app/controllers/companies_controller.rb

  def index
    @per_pages = 10
    @companies = Company.search(params[:search]).order(sort_column + ' ' + sort_direction).paginate(page: params[:page], per_page: @per_pages)
---
SELECT  `companies`.* FROM `companies` WHERE (name LIKE '%%')  ORDER BY address desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM `companies` WHERE (name LIKE '%%')

  def export
    @companies = Company.search(params[:search]).order(sort_column + ' ' + sort_direction)
---
SELECT `companies`.* FROM `companies` WHERE (name LIKE '%news%')  ORDER BY name asc

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO `companies` (`name`, `address`, `active`, `created_at`, `updated_at`) VALUES ('test', 'ssdfdsfsf', 1, '2016-03-10 22:50:45', '2016-03-10 22:50:45')

  def update
    respond_to do |format|
      if @company.update(company_params)
---
UPDATE `companies` SET `name` = 'Tye International', `address` = '125 Richardson Court', `active` = 0, `updated_at` = '2016-03-10 23:21:06' WHERE `companies`.`id` = 2

  def destroy
    @company.destroy
---
DELETE FROM `companies` WHERE `companies`.`id` = 3

    def set_company
      @company = Company.find(params[:id])
---
SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 3 LIMIT 1