app/controllers/leads_controller.rb

SELECT `leads`.* FROM `leads`
---
  def index
    @leads = Lead.all