app/controllers/states_controller.rb

SELECT `states`.* FROM `states`
---
  def index
    @states = State.all

INSERT INTO `states` (`name`, `abb`, `created_at`, `updated_at`) VALUES ('dfsdfsd', 'sdfdsfdss', '2016-03-15 20:49:30', '2016-03-15 20:49:30')
---
  def create
    @state = State.new(state_params)

    respond_to do |format|
      if @state.save

SELECT  `states`.* FROM `states` WHERE `states`.`id` = 1 LIMIT 1
---
    def set_state
      @state = State.find(params[:id])